In [1]:
import numpy as np
import pandas as pd

Hierarchial Indexing

In [2]:
data = pd.Series(   
                    np.random.uniform(size=9),                
                    index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],
                    [1, 2, 3, 1, 3, 1, 2, 2, 3]]
                )

In [3]:
data

a  1    0.071538
   2    0.055175
   3    0.567232
b  1    0.085973
   3    0.252899
c  1    0.180692
   2    0.732116
d  2    0.764077
   3    0.719851
dtype: float64

In [4]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [5]:
data['b']

1    0.085973
3    0.252899
dtype: float64

In [6]:
data["b":"c"]

b  1    0.085973
   3    0.252899
c  1    0.180692
   2    0.732116
dtype: float64

In [7]:
data.loc[["b", "d"]]

b  1    0.085973
   3    0.252899
d  2    0.764077
   3    0.719851
dtype: float64

In [8]:
data.unstack()

          1         2         3
a  0.071538  0.055175  0.567232
b  0.085973       NaN  0.252899
c  0.180692  0.732116       NaN
d       NaN  0.764077  0.719851

In [12]:
type(data.unstack())

pandas.core.frame.DataFrame

In [13]:
data.unstack().stack()

a  1    0.071538
   2    0.055175
   3    0.567232
b  1    0.085973
   3    0.252899
c  1    0.180692
   2    0.732116
d  2    0.764077
   3    0.719851
dtype: float64

In [14]:
frame = pd.DataFrame(
                        np.arange(12).reshape((4, 3)),
                        index=[["a", "a", "b", "b"], [1, 2, 1, 2]],
                        columns=[["Ohio", "Ohio", "Colorado"],
                        ["Green", "Red", "Green"]]
                    )
#column hierarchial indexing

In [15]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [18]:
frame.index

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [19]:
frame.index.names = ["key1", "key2"]

In [20]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [21]:
frame.columns.names = ["state", "color"]

In [22]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [23]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

Reordering and Sorting Levels

In [24]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [25]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [27]:
frame.sort_index()

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11